In [3]:
pip install pandas

Collecting pandasNote: you may need to restart the kernel to use updated packages.

  Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.1

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [44]:
import pandas as pd

In [57]:
data = {'שם': ['אליז', 'בת שבע', 'גליה'],
        'ממוצע': [25, 32, 18],
        'כיתה': [' יב', 'יא', 'ט']}

In [58]:
sample = pd.DataFrame(data)
sample

       שם  ממוצע כיתה
0    אליז     25   יב
1  בת שבע     32   יא
2    גליה     18    ט

In [68]:
new_student = {'שם': 'John', 'ממוצע': 35, 'כיתה': 'יכ'}
sample.loc[len(sample)] = new_student
sample

       שם  ממוצע כיתה
0    אליז     25   יב
1  בת שבע     32   יא
2    גליה     18    ט
3    John     35   יכ
4    John     35   יכ

In [69]:
other_df = sample['שם']
other_df

0      אליז
1    בת שבע
2      גליה
3      John
4      John
Name: שם, dtype: object

In [70]:
sample[sample['כיתה'] =="יא"]

       שם  ממוצע כיתה
1  בת שבע     32   יא

In [71]:
df = pd.read_csv('cities.csv')
new=df.drop_duplicates()
new

,LatD,"""LatM""",LatS,NS,LonD,"LonM""""","""LonS""",EW,City,State
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [72]:
df.LatD = df.LatD.fillna("no model selected")

In [73]:
df['LatD'].mean()

38.8203125

In [74]:

df[df['LonD'] ==df.LonD.max()]

,LatD,"""LatM""",LatS,NS,LonD,"LonM""""","""LonS""",EW,City,State
33,49,16,12,"""N""",123,7,12,"""W""","""Vancouver""",BC
101,44,56,23,"""N""",123,1,47,"""W""","""Salem""",OR

In [75]:
df[df['LonD'] ==df.LonD.min()]

,LatD,"""LatM""",LatS,NS,LonD,"LonM""""","""LonS""",EW,City,State
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA

In [89]:
df['יחס']=df[LatD]/[LonD]
df

NameError: name 'LatD' is not defined

In [ ]:
df[df['City'] ==["Vancouver"]
df= df.sort_values(by='LatD	', ascending=True)